In [2]:
# 数据清洗包含了缺失值、重复值、字符串操作等等内容 是数据预处理中重要的一部分
import pandas as pd
import numpy as np
from numpy import nan as NULL
from numpy import nan as NA
from pandas import DataFrame, Series

In [3]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [4]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0] = None

In [7]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [8]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [9]:
string_data.dropna()

1    artichoke
3      avocado
dtype: object

In [10]:
string_data.notna()

0    False
1     True
2    False
3     True
dtype: bool

In [11]:
string_data.fillna?

In [12]:
df = DataFrame([1,2]).reindex?

Object `reindex` not found.

In [ ]:
df = DataFrame([1,2]).reindex

In [13]:
df = DataFrame([1,2]).reindex

In [14]:
df = DataFrame(np.arange(10))

In [15]:
df.reindex?

In [16]:
string_data.fillna(method='ffill')

0         None
1    artichoke
2    artichoke
3      avocado
dtype: object

In [17]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [18]:
data.dropna() # remove缺失值

0    1.0
2    3.5
4    7.0
dtype: float64

In [19]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                   [NA, NA, NA], [NA, 6.5, 3.]], columns=list('abc'))

In [20]:
data

     a    b    c
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
cleaned = data.dropna(how='all') # 当所有值都是NA才删除

In [22]:
cleaned

     a    b    c
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [23]:
data['a'][1] = NA

In [24]:
data.dropna?

In [25]:
data[4] = NA

In [26]:
data

     a    b    c   4
0  1.0  6.5  3.0 NaN
1  NaN  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [27]:
data.dropna(axis=1, how='all')

     a    b    c
0  1.0  6.5  3.0
1  NaN  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [28]:
data.drop?

In [29]:
data.drop(0)

    a    b    c   4
1 NaN  NaN  NaN NaN
2 NaN  NaN  NaN NaN
3 NaN  6.5  3.0 NaN

In [30]:
df = pd.DataFrame(np.random.randn(7, 3))

In [31]:
df.iloc[:4, 1] = NA

In [32]:
df.iloc[:2, 2] = NA

In [33]:
df

          0         1         2
0  0.137344       NaN       NaN
1 -0.268353       NaN       NaN
2  0.070961       NaN -0.866481
3 -1.807099       NaN  0.674011
4  0.087909 -0.396619  0.194014
5 -0.710185  0.672524 -0.545116
6 -1.287041 -1.585493  0.039175

In [34]:
df.dropna()

          0         1         2
4  0.087909 -0.396619  0.194014
5 -0.710185  0.672524 -0.545116
6 -1.287041 -1.585493  0.039175

In [35]:
df.dropna(axis=1)

          0
0  0.137344
1 -0.268353
2  0.070961
3 -1.807099
4  0.087909
5 -0.710185
6 -1.287041

In [36]:
df.dropna(thresh=2, inplace=False)

          0         1         2
2  0.070961       NaN -0.866481
3 -1.807099       NaN  0.674011
4  0.087909 -0.396619  0.194014
5 -0.710185  0.672524 -0.545116
6 -1.287041 -1.585493  0.039175

In [37]:
df

          0         1         2
0  0.137344       NaN       NaN
1 -0.268353       NaN       NaN
2  0.070961       NaN -0.866481
3 -1.807099       NaN  0.674011
4  0.087909 -0.396619  0.194014
5 -0.710185  0.672524 -0.545116
6 -1.287041 -1.585493  0.039175

In [38]:
df

          0         1         2
0  0.137344       NaN       NaN
1 -0.268353       NaN       NaN
2  0.070961       NaN -0.866481
3 -1.807099       NaN  0.674011
4  0.087909 -0.396619  0.194014
5 -0.710185  0.672524 -0.545116
6 -1.287041 -1.585493  0.039175

In [39]:
df.fillna({1: 0.5, 2: 0}) # 使用字典分别指定不同列的处理方法

          0         1         2
0  0.137344  0.500000  0.000000
1 -0.268353  0.500000  0.000000
2  0.070961  0.500000 -0.866481
3 -1.807099  0.500000  0.674011
4  0.087909 -0.396619  0.194014
5 -0.710185  0.672524 -0.545116
6 -1.287041 -1.585493  0.039175

In [40]:
df.fillna(limit=2, method='bfill', inplace=True)

In [41]:
df.fillna(limit=2, method='ffill', inplace=True)

In [42]:
df

          0         1         2
0  0.137344       NaN -0.866481
1 -0.268353       NaN -0.866481
2  0.070961 -0.396619 -0.866481
3 -1.807099 -0.396619  0.674011
4  0.087909 -0.396619  0.194014
5 -0.710185  0.672524 -0.545116
6 -1.287041 -1.585493  0.039175

In [43]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [44]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [45]:
data.fillna(data.mean()) # 使用平均值进行填充

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [46]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [47]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                    'k2': [1, 1, 2, 3, 3, 4, 4]})

In [48]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [49]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [50]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [51]:
data['k3'] = range(7)

In [52]:
data

    k1  k2  k3
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [53]:
data.drop_duplicates(['k1', 'k2'], keep=False)

    k1  k2  k3
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4

In [54]:
data['k1'].str.title() # 创建字符串 然后使用字符串的内置函数对其进行操作

0    One
1    Two
2    One
3    Two
4    One
5    Two
6    Two
Name: k1, dtype: object

In [55]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                             'Pastrami', 'corned beef', 'Bacon',
                             'pastrami', 'honey ham', 'nova lox'],
                    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [56]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [57]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [58]:
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [59]:
lowercased = data['food'].str.lower()

In [60]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [61]:
data['animal'] = lowercased.map(meat_to_animal) # 使用map方法 获取键值对的映射

In [62]:
data.drop('animal', axis=1)

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [63]:
data['animal'] = lowercased.map(lambda x: meat_to_animal[x.lower()]) # 定义lambda函数 处理键值对的映射

In [64]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [65]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [66]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [67]:
data.replace(-999, NA)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [68]:
data.replace([1000, -999], NA)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [69]:
data.replace([-1000, -999], [0, NA])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [70]:
data.replace({-1000: 0, -999: NA})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [71]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [72]:
data.replace?

In [73]:
data.replace(None, method='ffill')

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [74]:
str1 = 'hello world'
str1.replace('hel', 'fuck')

'fucklo world'

In [75]:
str1

'hello world'

In [76]:
str.replace?

In [77]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                   index=['Ohio', 'Colorado', 'New York'],
                   columns=['one', 'two', 'three', 'four'])

In [78]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [79]:
transform = lambda x: x[:4].upper()

In [80]:
transform

In [81]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [82]:
data.index = data.index.map(transform)

In [83]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [84]:
data.index = data.index.str.title()

In [85]:
data

      one  two  three  four
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [86]:
data.columns

Index(['one', 'two', 'three', 'four'], dtype='object')

In [87]:
data.columns = data.columns.str.upper()

In [88]:
data

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [89]:
data.rename?

In [90]:
# data.rename(index=str.title, columns=str.upper) # ?
data

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [91]:
data.rename(index={'Ohio': "INDIANA"},
           columns={'THREEE': 'peekaboo'}, inplace=True)

In [92]:
data

         ONE  TWO  THREE  FOUR
INDIANA    0    1      2     3
Colo       4    5      6     7
New        8    9     10    11

In [93]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [94]:
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [95]:
bins = [18, 25, 35, 60, 100]

In [96]:
cats = pd.cut(ages, bins, right=True)

In [97]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [98]:
cats.codes # 获取值所属的箱位

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [99]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [100]:
pd.value_counts(cats) # 箱也可以算作是一种数据值

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [101]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [102]:
pd.cut(ages, bins, right=True, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [103]:
data = np.random.randn(20)

In [104]:
pd.cut(data, 4, precision=2)

[(-0.81, -0.029], (-0.029, 0.75], (-0.029, 0.75], (-1.58, -0.81], (-0.81, -0.029], ..., (-0.81, -0.029], (-0.029, 0.75], (-2.36, -1.58], (-0.81, -0.029], (-0.81, -0.029]]
Length: 20
Categories (4, interval[float64, right]): [(-2.36, -1.58] < (-1.58, -0.81] < (-0.81, -0.029] < (-0.029, 0.75]]

In [105]:
data = np.random.randn(1000) # 正态分布

In [106]:
data

array([-0.7342054 , -1.13807051,  0.70316864,  0.58038069, -1.20276925,
       -1.4904522 , -0.79584755,  1.1990954 , -0.96239253,  1.10929477,
       -0.21898713, -0.08150297, -1.06537389, -0.25512066,  0.63591142,
       -1.24908802,  0.41911758, -0.11707307,  0.20434477, -0.4530003 ,
        0.47267289, -1.79713562, -0.41257439, -1.15906981, -1.06377174,
       -0.01543137, -1.16108777, -1.17259909,  0.02299728,  0.60907217,
       -1.20928314, -1.81938137,  0.74171489,  0.08457142, -0.03077889,
        0.04355792,  1.08331757, -0.48967144,  1.03542548,  0.03909454,
        0.98509122,  1.64644849, -1.57127545, -0.93489501, -0.05203847,
       -1.15921251, -1.26105528,  1.31612929, -0.15149816, -0.90710887,
        0.07081808,  0.47025758, -1.17391528,  0.48828866, -0.91691153,
        1.26588603,  0.03297141, -2.19887226, -0.50263048, -0.23581576,
        0.62247305,  0.80176338,  0.59385007,  1.2239481 , -0.48922623,
        0.156211  ,  1.31265164, -0.35556347,  1.06226675,  0.9348282 ,
       -2.35340665, -0.79621977,  1.0485376 ,  1.16974045,  0.97742971,
        0.53947617,  0.79327031, -0.78239041,  1.29141609,  0.35378398,
        0.26569145,  1.26221292,  0.61287543, -0.34312135,  1.13294876,
        0.67390856, -0.53467604,  0.87453637,  0.20642007, -1.60329476,
        1.18892955, -1.85948334, -0.75418009,  1.60471413, -1.20513259,
        0.35820562, -1.41389176,  1.03524265,  0.34958902, -0.56323336,
        0.15922095,  0.63434208,  0.53833655,  0.19415551, -0.6044536 ,
       -0.3976238 , -1.19739162, -0.47115751, -1.64142199,  0.60440191,
        0.7525494 ,  0.70637167, -0.13454126, -0.31542067, -1.02597899,
       -1.07907967, -0.52691348, -2.18851227,  0.29325766, -0.76585516,
        2.15346001,  0.09386839, -0.11227637,  0.25181084,  0.24052612,
       -0.48085683, -0.02753111, -0.92567475,  0.37244718, -0.63776493,
        0.70885694, -0.98533289,  1.77432277, -1.01142268, -0.50351366,
       -0.31216466,  0.04896516,  0.69104471, -0.130062  ,  0.63295747,
        0.97334868, -1.73603823,  1.0239891 , -1.64910103,  0.23910739,
       -0.83108819,  1.22105623, -0.14411426, -0.04953763,  0.6651884 ,
       -0.68761128,  1.29784782,  0.08013602, -1.78923867,  0.7180354 ,
        2.07346299, -0.31770998, -0.97727724, -1.02618356, -0.01041613,
        0.10093677,  0.03628451, -1.03767416, -1.33578163, -0.60538533,
        1.93653413,  1.15129606,  0.28072117, -0.45673502,  1.03916964,
       -0.85592318,  1.00227198, -0.03147709,  0.23288289,  1.29537124,
       -1.92484033, -1.79653425, -0.82321517, -0.13346126, -0.35404415,
       -1.39811802,  0.08168665,  0.23908701, -0.09007224,  0.07694226,
       -2.01427956,  0.15410127, -0.71054287,  0.43193644, -0.90604103,
        0.60041303, -0.86844373,  0.75612232,  1.18764401,  0.00714886,
        1.90639013, -1.29517572,  1.74587665,  0.37676596, -0.10502045,
       -1.34438888,  0.72953309,  1.383747  ,  0.14326163,  1.22802084,
        1.4023153 , -0.73613395,  1.3770669 , -1.80743804, -0.42742984,
       -0.52321972,  0.43757507, -0.32143704, -0.02728968,  0.87856265,
       -2.00518171, -0.28465806, -0.5419641 ,  0.27416722, -0.57202419,
       -0.01875117,  1.10291295,  0.43401607,  0.10036019,  0.16288454,
        0.35919639,  1.03112171, -1.39979702,  0.97039922,  0.37396859,
       -2.30581155, -0.4479529 , -0.02020663, -1.00669645, -1.0496941 ,
        0.83709992, -0.04484625, -0.59988117, -0.01463185,  0.77566223,
        0.46614835, -0.21556345, -0.60808415,  1.18619907,  1.46355195,
        1.08272275, -0.42181812, -1.72149794,  0.05137868, -0.78163989,
       -0.01802456,  0.4209145 ,  0.93865069, -2.1370842 ,  0.92803656,
       -0.08304793, -0.52226342, -0.75117129, -0.04780446, -0.05339469,
       -1.61334746,  0.03119485, -0.12316446, -1.23326161, -0.15849112,
        0.30356112,  0.43855394,  0.19013921,  2.24741633,  0.42372511,
       -0.63868402, -0.25611902,  0.51524802,  0.5684956 ,  0.17792295,
       -1.6154536 , -0.04849076,  1.15167326,  0.17808636, -0.32448305,
        0.71374493,  0.06765127, -0.5199981 ,  2.20932097,  0.66900968,
       -2.73193485,  0.64399551, -0.70042722, -0.99728185,  1.21187274,
       -1.05788411,  0.39665811, -2.78887999,  1.92483405, -0.42705481,
        0.20501815, -0.31789464, -0.09259696,  0.0935855 , -0.42920942,
       -0.05914829,  1.98313179, -0.85657203, -0.11336375, -0.17097593,
       -1.27476615,  1.15601087, -0.58064517, -0.25888057,  3.18287027,
       -0.0483817 , -0.1238239 , -1.09478326,  1.59598989, -0.62026084,
        0.3551306 ,  3.06723172,  1.24951467, -0.37848013,  0.70568314,
       -0.54570731, -0.56650075,  1.79602807, -0.45879958,  0.63450281,
        0.5966719 , -0.85438252, -0.80471589,  0.85542208, -0.20236049,
        0.93770399,  1.39967341,  0.12153336,  0.17999567, -1.17105944,
       -0.37847265, -0.22272053, -0.12734178,  0.14456705, -1.16673436,
       -0.44898045,  0.14805303, -1.6979507 ,  1.24666229, -1.75946409,
       -1.26502876,  1.14202826,  1.16207109,  1.24151534,  0.52728689,
        0.13460951, -0.3212946 ,  1.16964033,  1.09704644,  0.36527507,
        1.30592669, -0.35867027, -1.58786672, -0.85956321, -0.12757366,
        0.31027748,  1.08454171,  0.04326883,  1.68072211,  1.48769288,
        0.86631954,  1.40549782, -0.83094762, -0.43437733,  0.89029221,
        1.27146818, -0.03927259, -1.01507361, -0.97341145, -0.16728535,
       -0.12160151,  0.21956193, -0.00522473,  0.60370857, -0.48752736,
       -1.11749022,  1.01373721, -1.64422719,  0.20683768, -1.83624364,
       -0.28714002, -0.65559168,  0.93241405,  1.25267183,  1.06864551,
       -0.93091126, -0.06781997,  0.13101467, -0.54806452,  1.1287309 ,
       -1.41687834,  1.51565051, -1.29709912, -0.09666775, -1.48087396,
       -0.31862267, -1.16108902,  0.1246349 ,  0.07717497, -1.42563288,
       -1.23115735,  1.23556052,  0.37941967, -0.34151721, -0.78547807,
        0.02485649,  0.54062523,  1.04767226, -0.43217332, -0.50325543,
       -1.27883237, -1.06065892, -0.48442219,  0.33090054, -0.56437407,
        0.37417513,  0.60984759,  0.33660717, -0.12731932,  0.70514013,
        1.40538642,  1.42470613,  0.60551553, -0.63660289,  1.28440948,
        0.21684135,  0.18885445, -0.75825459, -0.19272228, -0.06256443,
        0.37580396,  1.59520016, -1.60640822, -0.40307894,  0.61803159,
        0.70222926, -1.03205118,  0.90696046, -0.77867182,  2.3324123 ,
       -0.19873242, -0.79163315, -0.45577652, -0.58781759,  0.34012861,
       -0.43890756, -1.61007451,  0.1327449 ,  0.11259288, -0.7373163 ,
        1.14108041,  1.12614626,  1.09073835, -2.32582226, -0.05089969,
       -0.17992372, -0.30879693, -1.50476101,  0.8824557 ,  1.13054889,
        0.40275497,  1.69467754, -1.33175136,  0.37533458, -0.09534489,
       -0.26377846,  0.74198963, -1.53798695, -0.06836889,  0.50547916,
       -1.69922985,  0.07979297,  2.50223118, -0.05970558, -0.8642905 ,
        0.132061  ,  0.93785748, -0.07620563, -0.50001875, -1.7769687 ,
       -0.80458124,  1.35101413,  1.21596807,  1.12255135, -2.37627442,
        0.33258971,  0.99490835,  0.1892005 ,  1.15077881,  0.15321688,
        1.36091238, -0.73506785, -0.58732026, -0.97526634,  0.35315226,
        0.33562313, -0.05274959, -0.22455741,  1.17792455, -0.78988362,
        0.89259559,  0.0064686 ,  0.96511832, -0.04000764,  0.72620781,
        0.30677327,  1.5537431 , -1.39377197, -0.2420454 , -0.55408005,
       -1.53913983, -0.78776832,  0.2599101 , -0.45051403,  1.06326918,
        0.59065924, -1.67094565,  0.06197585,  1.26850462,  0.51551062,
        0.43223034,  0.42711647,  1.87056409, -0.96406682,  1.20723224,
       -1.07825263,  1.06930586, -1.06344538,  0.32073275, -1.03564556,
        1.09956374, -0.79427076, -0.07742323, -0.88881212,  0.37699193,
       -2.10886221,  0.62828322, -0.45499909, -2.29958456,  0.21274335,
       -2.13651045, -1.12088381,  1.18716443,  0.61137342, -0.18501053,
       -0.03811409, -0.17470984,  0.72069763, -0.49406155, -0.49820603,
        0.19720505, -1.59183977, -0.11407335,  0.95794302, -0.25047097,
        0.16814158, -0.71021066,  1.58420489,  1.86459285, -0.00465142,
       -1.34601084, -0.31972035, -0.16378305,  0.74237388, -0.59486216,
       -0.33009823, -0.92336177,  0.35804277, -1.42206029, -2.02899609,
       -1.82932306, -0.42045428,  0.36484647,  0.10900288,  1.35778332,
        0.98973047,  0.66295175, -0.97897008, -0.62989931, -0.41244087,
        0.71498902, -0.4282418 , -1.78740967,  0.07528623,  1.38340353,
        1.07441562,  0.42610989,  1.60585838,  2.02595059, -1.63345352,
       -2.01496083,  1.21998973,  0.4356109 ,  0.96002899,  0.29860471,
        1.43217006,  1.03553818, -0.09011621,  0.51291306, -0.56476854,
        0.64549886, -0.64573315, -0.1444981 , -0.79228943, -0.25865691,
       -0.70262189, -1.18886393,  1.04056526,  0.48567656,  0.12639215,
        1.68803951, -0.70792268, -1.82183789,  0.1866463 ,  1.40195384,
       -0.88759227, -1.24610329, -0.37114809, -0.68350125,  0.01341261,
       -1.77715978, -0.64808919,  0.82733762, -1.31363763,  1.03605462,
        0.5922063 ,  0.82010836, -0.79393298, -0.23362582, -0.79429563,
       -0.19826772,  0.25610952,  0.64844447,  1.64526405, -0.89849335,
        0.83822746, -0.08132751,  0.31858003, -0.00987872,  0.63339023,
        1.56482007, -0.90853813, -0.7878266 , -0.5921777 ,  0.05386771,
       -0.6759255 , -1.51098242,  0.77813835, -1.18344386,  0.23252014,
        0.5130093 , -0.9598069 , -0.3393918 , -0.75103191,  0.24817191,
        0.44564067,  0.63509778,  0.8995423 , -0.96735025,  0.23512868,
       -0.69319645,  0.23241686,  1.73004507,  0.13574318, -1.98905167,
        0.39941633, -0.39353355,  0.56048703, -0.33856786, -2.47039176,
        0.47624899, -0.03148176,  0.27290847,  0.77983347,  1.66516064,
       -0.86880327, -0.06329806, -1.08692772, -0.36460598,  1.49648125,
        0.6236653 , -0.20982183,  0.51678214, -1.33330768, -0.52340014,
        1.55575475,  1.13467422,  1.66602344,  0.01271828, -1.16959993,
        1.15532619,  0.06180697,  0.01680886,  1.313168  , -0.24842085,
       -0.32401838, -2.65822754, -2.42788922, -0.01503731,  0.10560358,
        0.69151703, -0.49067148,  0.4665037 ,  0.28751944, -0.84277007,
        0.34262242, -0.89831607,  0.90750427, -0.24197314,  0.49538019,
       -0.12867335,  0.79578611,  0.0164132 ,  0.6956161 , -1.65226228,
       -0.36056768, -0.02772408, -0.61775525,  1.73042937,  0.90339114,
       -0.36892946,  1.10777532, -0.86048491,  1.10916438,  0.21666269,
       -0.94735968,  0.53805027, -2.2079271 ,  1.64324125, -0.08675887,
       -1.4387603 ,  0.97212105, -0.01064689,  0.41796494, -0.731545  ,
       -0.28578687, -0.14831794, -0.31220572,  0.55700838,  0.24682687,
       -0.62627215, -1.28302103,  0.8652231 , -0.81559881, -0.14095325,
       -0.40904141, -0.87927738,  0.38870408, -0.32691217, -0.07760513,
       -1.91531782,  1.17855046,  0.63774459, -1.02516655, -0.64427748,
        1.22812051, -1.12237625, -0.37133479,  0.90426248,  0.05758788,
        1.15284837,  1.0223383 , -0.93074898, -0.29688486,  0.68178769,
       -1.01809906, -0.81043813,  0.70309723,  0.2850929 ,  0.58310545,
       -0.22546159, -1.15246316,  0.25851296, -0.85635749, -0.8236473 ,
        0.27998414,  1.27840939,  0.12870126, -1.14269007, -0.51352973,
        0.24317966, -1.02199395,  0.62447852,  0.66019759,  0.50834293,
       -0.41890514, -0.62809303, -0.07174683,  1.02616054,  0.92470183,
        0.7558291 , -0.65413265, -0.60750371, -1.04481302,  0.0567075 ,
        0.43897376,  1.02882678, -0.40932408, -0.55228727, -0.02214589,
        0.45485263, -0.65571067,  0.0763263 , -1.00985043,  1.38905082,
        0.93866829, -0.21510177, -0.31444711, -0.93047055,  0.56462465,
       -1.54511505,  1.0244788 ,  1.16068816, -0.39610347,  0.61641724,
        0.49393876, -1.2326199 ,  0.76343578,  0.67576033, -0.44098747,
        0.65014615, -1.48087224,  0.57126449,  0.55657397, -1.98495984,
       -0.69798042, -1.30893132,  0.78698577,  0.60772817, -1.12281859,
        0.94208216,  0.39391783,  1.51942599,  0.03806771, -0.26078281,
        0.04809849,  0.94091416, -0.51934638,  0.19543104,  0.97972883,
       -1.1663041 , -0.03261191, -0.50256233, -0.91214876, -1.2982852 ,
       -0.28350701,  1.39446852, -0.83460897,  1.91967147, -0.9451084 ,
       -1.88380976, -0.02333812,  0.45064152,  1.97986798, -0.01997378,
        2.21812882,  1.7921116 ,  1.55286892, -0.00381334,  1.00884841,
        1.10924492, -0.18012782,  0.10800031, -0.70406799,  1.29185631,
        0.08700434,  0.86089472,  0.05984094,  0.75002228, -0.25773767,
       -0.04727568,  0.80939211,  1.64535887, -0.6433051 ,  0.66174513,
        0.91643362, -1.41019427, -0.1794    ,  0.35553881, -1.56340365,
        1.05437434,  1.37858286, -0.77566908, -0.71095671,  2.48977749,
        1.24926116,  0.41142565,  0.49012123,  1.77175065, -0.7038708 ,
        0.65492773, -1.81652329,  0.84950947, -0.52893209, -2.08569133,
        0.64408013, -1.16420665,  0.93056952,  1.02005286, -0.65422695,
        0.5488091 ,  0.40180038,  0.32205917,  0.29081619, -0.3372843 ,
       -1.84034352, -0.29698783,  0.9982259 , -1.22821849, -1.68403604,
       -1.23883653,  0.33866508, -1.02677981, -0.48509712,  0.4688893 ,
       -0.5733112 , -0.79933659, -0.24102154, -1.60444874,  0.91711544,
        0.34484929,  0.72087956, -0.69120826,  0.93699267,  1.52603042,
       -0.36837756,  0.27395082, -0.59037096,  0.60469695,  1.06062314,
        1.13009877,  0.65811389, -0.52687735, -0.36214766,  1.83910003,
       -0.14049147,  0.45079941,  1.62415575, -0.43585602,  0.66772253,
       -0.1985784 ,  0.34936732, -0.28488398, -0.13641352,  0.20631528,
        0.81366025,  1.0208968 , -0.42615757,  0.71300336, -0.22849639,
        0.1311235 , -0.34960883, -0.50761687, -1.1508204 ,  0.09781608,
        0.50161904,  0.48503932,  0.91260924, -0.03925798, -0.52574691,
        0.72053512,  0.89324763, -0.99688376,  0.67692907,  1.12918365,
        0.89277965, -0.53670057, -1.62647607,  0.06567651,  0.1755446 ,
       -0.6817444 , -1.12567914,  0.19362262, -0.64530367,  0.75510881,
        0.94881402,  0.15692476,  0.95818987,  0.65213392,  0.18187557,
        0.31654508,  0.74355257,  1.63928692, -0.25810401,  0.77762119,
        1.44720572,  0.18729523, -1.49504145,  0.64647249,  0.13213914,
        0.5549336 , -0.55208634,  1.72191441,  0.92062051,  0.53693087])

In [107]:
cats = pd.qcut(data, 4)

In [108]:
cats

[(-2.79, -0.644], (-2.79, -0.644], (0.697, 3.183], (0.0239, 0.697], (-2.79, -0.644], ..., (0.0239, 0.697], (-0.644, 0.0239], (0.697, 3.183], (0.697, 3.183], (0.0239, 0.697]]
Length: 1000
Categories (4, interval[float64, right]): [(-2.79, -0.644] < (-0.644, 0.0239] < (0.0239, 0.697] < (0.697, 3.183]]

In [109]:
pd.value_counts(cats)

(-2.79, -0.644]     250
(-0.644, 0.0239]    250
(0.0239, 0.697]     250
(0.697, 3.183]      250
dtype: int64

In [110]:
cats = pd.cut(data, 4, precision=2)

In [111]:
pd.value_counts(cats) # 不是均匀分布的个数

(-1.3, 0.2]      482
(0.2, 1.69]      399
(-2.79, -1.3]     90
(1.69, 3.18]      29
dtype: int64

In [112]:
cats = pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.0])

In [113]:
cats

[(-1.233, 0.0239], (-1.233, 0.0239], (0.0239, 1.19], (0.0239, 1.19], (-1.233, 0.0239], ..., (0.0239, 1.19], (-1.233, 0.0239], (1.19, 3.183], (0.0239, 1.19], (0.0239, 1.19]]
Length: 1000
Categories (4, interval[float64, right]): [(-2.79, -1.233] < (-1.233, 0.0239] < (0.0239, 1.19] < (1.19, 3.183]]

In [114]:
pd.value_counts(cats)

(-1.233, 0.0239]    400
(0.0239, 1.19]      400
(-2.79, -1.233]     100
(1.19, 3.183]       100
dtype: int64

In [115]:
print('hello world')

hello world

In [116]:
df.rename?

In [117]:
# 字符串处理函数

In [118]:
val = 'a,b,   guido'

In [119]:
val.split(',')

['a', 'b', '   guido']

In [120]:
lst = [x.strip() for x in val.split(',')]

In [121]:
lst

['a', 'b', 'guido']

In [122]:
first, second, third = lst

In [123]:
first

'a'

In [124]:
first+"::"+second+"::"+third

'a::b::guido'

In [125]:
"::".join(lst) # join函数将一个序列作为参数 将字符"::"添加到字符序列中

'a::b::guido'

In [126]:
first.casefold()

'a'

In [128]:
third.casefold()

'guido'

In [132]:
third.ljust(100)

'guido                                                                                               '

In [133]:
# 正则表达式匹配
import re

In [134]:
text = "foo      bar\t baz    \tqux"

In [135]:
text

'foo      bar\t baz    \tqux'

In [136]:
regex = re.split("\s+", text) # 匹配多个空格

In [137]:
regex

['foo', 'bar', 'baz', 'qux']

In [142]:
regex = re.compile('\\s+') # 避免转义字符的影响

In [143]:
regex

re.compile(r'\s+', re.UNICODE)

In [144]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [145]:
text = """
Dave dave@google.com
Steve steve@qq.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [146]:
text

'\nDave dave@google.com\nSteve steve@qq.com\nRob rob@gmail.com\nRyan ryan@yahoo.com\n'

In [147]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [148]:
pattern

'[A-Z0-9._%+-]+@[A-Z0-9.-]+\\.[A-Z]{2,4}'

In [149]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [150]:
regex

re.compile(r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}', re.IGNORECASE|re.UNICODE)

In [151]:
regex.findall(text)

['dave@google.com', 'steve@qq.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [154]:
fuck = regex.search(text) # 返回的是一个位置对象

In [155]:
text[fuck.start():fuck.end()]

'dave@google.com'

In [156]:
regex.match(text)

In [157]:
print(regex.match(text))

None

In [168]:
print(regex.subn("HELLO RE", text, 10)) # 将匹配到的字符串替换掉

('\nDave HELLO RE\nSteve HELLO RE\nRob HELLO RE\nRyan HELLO RE\n', 4)

In [164]:
# 向量化字符串处理方法

In [232]:
data = {'Dave': 'dave@google.com',
       'Steve': 'steve@gmail.com',
       'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [233]:
data

{'Dave': 'dave@google.com',
 'Steve': 'steve@gmail.com',
 'Rob': 'rob@gmail.com',
 'Wes': nan}

In [234]:
data

{'Dave': 'dave@google.com',
 'Steve': 'steve@gmail.com',
 'Rob': 'rob@gmail.com',
 'Wes': nan}

In [235]:
data = pd.Series(data)

In [236]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [237]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [238]:
data.str.contains('gmail') # 是否包含gmail

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [239]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [240]:
data.str.findall(pattern, flags=re.IGNORECASE) #

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [241]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [242]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [243]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [244]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [245]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [247]:
matches.str[:5]

AttributeError: Can only use .str accessor with string values!

In [194]:
matches.str[0]

AttributeError: Can only use .str accessor with string values!

In [201]:
matches = matches.map(str)

In [204]:
matches.str.get(1)

Dave     r
Steve    r
Rob      r
Wes      a
dtype: object

In [205]:
matches.str[0]

Dave     T
Steve    T
Rob      T
Wes      n
dtype: object

In [206]:
matches.str[:5]

Dave     True
Steve    True
Rob      True
Wes       nan
dtype: object

In [207]:
data.str[:5]  # str模块只能操作字符串类型的数据

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [209]:
data[[1]] = 10

In [210]:
data

Dave     dave@google.com
Steve                 10
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [211]:
data.str[:5]

Dave     dave@
Steve      NaN
Rob      rob@g
Wes        NaN
dtype: object

In [212]:
data.str.get(2)

Dave       v
Steve    NaN
Rob        b
Wes      NaN
dtype: object

In [223]:
matches.str.get(1)

Dave     NaN
Steve    NaN
Rob      NaN
Wes      NaN
dtype: object

In [224]:
matches

Dave     NaN
Steve    NaN
Rob      NaN
Wes      NaN
dtype: object

In [248]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [250]:
data.count()

3

In [251]:
data.count?

In [252]:
data.str.isalnum()

Dave     False
Steve    False
Rob      False
Wes        NaN
dtype: object

In [253]:
data.str.join('::')

Dave     d::a::v::e::@::g::o::o::g::l::e::.::c::o::m
Steve    s::t::e::v::e::@::g::m::a::i::l::.::c::o::m
Rob            r::o::b::@::g::m::a::i::l::.::c::o::m
Wes                                              NaN
dtype: object

In [254]:
data.str.lower()

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [255]:
data.str.upper()

Dave     DAVE@GOOGLE.COM
Steve    STEVE@GMAIL.COM
Rob        ROB@GMAIL.COM
Wes                  NaN
dtype: object

In [256]:
data.str.lower()

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [257]:
data.str.repeat(3)

Dave     dave@google.comdave@google.comdave@google.com
Steve    steve@gmail.comsteve@gmail.comsteve@gmail.com
Rob            rob@gmail.comrob@gmail.comrob@gmail.com
Wes                                                NaN
dtype: object

In [265]:
text = 'ss 1394078963@qq.com'

In [283]:
pattern = r'[0-9a-z+-\.]*@[a-z]+\.[a-z]{2,3} # 你好吗'

In [284]:
re.findall(pattern, text, flags=re.VERBOSE) # 用来跳过注释

['1394078963@qq.com']

In [263]:
re.findall?

In [278]:
re.IGNORECASE?

In [279]:
re.findall?

In [285]:
text = "foo      bar\t baz    \tqux"

In [286]:
text

'foo      bar\t baz    \tqux'

In [287]:
regex = re.compile(r'\s+')

In [290]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']